holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.h
/** -------------------------------------------------------------------------------------
 * SatIO LVGL - Written by Benjamin Jack Cullen.
 */

#ifndef SATIO_LVGL_H
#define SATIO_LVGL_H

#include "lvgl.h"

#include "bsp/esp32_p4_wifi6_touch_lcd_xc.h"
#include <limits.h>
#include "esp_log.h"
#include "lvgl.h"
#include <stdlib.h>
#include "ff.h"
#include "diskio.h"
#include "diskio_impl.h"
#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include "driver/sdmmc_host.h"
#include "esp_err.h"
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#include <stdio.h>
#include <dirent.h>
#include "bsp/esp-bsp.h"

#include <stdio.h>
#include <limits.h>
#include <string.h>
#include <assert.h>
#include <float.h>
#include <math.h>
#include <Arduino.h>

#include "./config.h"
#include "./REG.h"
#include "./strval.h"
#include "./meteors.h"
#include "./wtgps300p.h"
#include "./wt901.h"
#include "./multiplexers.h"
#include "./sidereal_helper.h"
#include "./hextodig.h"
#include "./ins.h"
#include "./satio.h"
#include "./custommapping.h"
#include "./matrix.h"
#include "./serial_infocmd.h"
#include "./system_data.h"
#include "./sdcard_helper.h"
#include "./task_handler.h"
// #include "./multi_display_controller.h"
#include "./i2c_helper.h"
#include "./wit_c_sdk.h"
#include "./astroclock.h"

#include <sys/time.h>
#include <rtc_wdt.h>
#include <esp_task_wdt.h>
#include "esp_pm.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_partition.h"
#include "esp_spiffs.h"
#include "esp_heap_caps.h"
#include "nvs_flash.h"
#include "esp_system.h"
#include "driver/uart.h"

/* Enable complex draw engine (required for anti-aliasing) */
#define LV_USE_DRAW_SW              1

#if LV_USE_DRAW_SW
    /* Enable complex shapes (arcs, lines, polygons, etc.) */
    #define LV_DRAW_SW_COMPLEX      1
    
    /* Set to 1 to enable anti-aliasing */
    #define LV_DRAW_SW_ASM          LV_DRAW_SW_ASM_NONE
#endif

// LV_FONT_DECLARE(active_space_10);
// LV_FONT_DECLARE(space_ranger_15);
LV_FONT_DECLARE(cobalt_alien_17);
// LV_FONT_DECLARE(space_ranger_19);
// LV_FONT_DECLARE(space_ranger_21);
// LV_FONT_DECLARE(space_ranger_23);
LV_FONT_DECLARE(cobalt_alien_25);

#define LV_TXT_ALPHA_LC "abcdefghijklmnopqrstuvwxyz"
#define LV_TXT_ALPHA_UC "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
#define LV_TXT_NUM      "0123456789"
#define LV_TXT_NUMDEC  "0123456789.-"
#define LV_TXT_ALNUMDEC "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789.-"

/** ---------------------------------------------------------------------------------------
 * @brief Button Struct
 * 
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * label;
    lv_obj_t * button;
} button_t;

/** ---------------------------------------------------------------------------------------
 * @brief System Tray Struct
 * 
 */
typedef struct {
    lv_obj_t * tray;
    lv_obj_t * panel;
    bool       is_open;
    lv_obj_t * slider_brightness;
    lv_obj_t * local_time;
    lv_obj_t * local_date;
    lv_obj_t * human_date;
    lv_obj_t * datetime_sync;
    lv_obj_t * serial_cmommand_enabled;
    lv_obj_t * gps_signal_strength;
    lv_obj_t * sdcard_mounted;
    lv_obj_t * grid_menu_1;
} system_tray_t;

/** ---------------------------------------------------------------------------------------
 * Title Bar Struct
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * time_label;
    lv_obj_t * date_label;
    lv_obj_t * datetime_sync;
    lv_obj_t * serial_cmommand_enabled;
    lv_obj_t * gps_signal_strength;
    lv_obj_t * sdcard_mounted;
} title_bar_t;

/** ----------------------------------------------------------------------------------------
 * @brief Structure to hold image data.
 * 
 */
typedef struct {
    uint32_t        f_size;
    uint8_t       * bytes_in_psram;
    lv_obj_t      * lv_image_obj;
    lv_image_dsc_t  dsc;
} sdcard_image_t;

/** ---------------------------------------------------------------------------------------
 * @brief Keyboard Struct
 * 
 */

typedef struct {
    lv_obj_t * kb;
    lv_obj_t * ta;
} keyboard_t;

/** ---------------------------------------------------------------------------------------
 * @brief Menu Struct
 * 
 */
typedef struct {
    lv_obj_t *   main_header;
    lv_obj_t *   back_button;
    lv_obj_t *   back_label;
    lv_obj_t *   menu;
    lv_obj_t **  pages;
    int          max_pages;
    int          page_count;
    lv_obj_t *** page_items;
    uint32_t *   page_item_counts;
    uint32_t     max_items_per_page;
} menu_struct;

/** ---------------------------------------------------------------------------------------
 * @brief Matrix Function Container Struct
 * 
 * Container for displaying and editing matrix function parameters.
 */
typedef struct {
    lv_obj_t * panel;                   

    // Switch selection
    lv_obj_t * label_switch_index_select;
    lv_obj_t * dd_switch_index_select;

    // Function selection
    lv_obj_t * label_function_index_select;
    lv_obj_t * dd_function_index_select;
    
    // Function info
    lv_obj_t * label_function_name;
    lv_obj_t * dd_function_name;
    
    // XYZ values (textareas for input)
    lv_obj_t * label_x;
    lv_obj_t * ta_x;
    lv_obj_t * dd_x;
    lv_obj_t * label_mode_x;
    lv_obj_t * dd_mode_x;
    lv_obj_t * label_y;
    lv_obj_t * ta_y;
    lv_obj_t * dd_y;
    lv_obj_t * label_mode_y;
    lv_obj_t * dd_mode_y;
    lv_obj_t * label_z;
    lv_obj_t * ta_z;
    lv_obj_t * dd_z;
    lv_obj_t * label_mode_z;
    lv_obj_t * dd_mode_z;
    
    // Operator
    lv_obj_t * label_operator;
    lv_obj_t * dd_operator;
    
    // Flux (textarea for input)
    lv_obj_t * label_flux;
    lv_obj_t * ta_flux;
    
    // Output mode (dropdown)
    lv_obj_t * label_output_mode;
    lv_obj_t * dd_output_mode;
    
    // PWM values (textareas for input)
    lv_obj_t * label_output_pwm_0;
    lv_obj_t * label_output_pwm_1;
    lv_obj_t * ta_pwm_0;
    lv_obj_t * ta_pwm_1;
    
    // Invert Function Logic
    lv_obj_t * label_inverted_logic;
    lv_obj_t * dd_inverted_logic;
    
    // Map Slot
    lv_obj_t * label_map_slot;
    lv_obj_t * dd_map_slot;

    // Port
    lv_obj_t * label_port_map;
    lv_obj_t * ta_port_map;

    // Switches
    button_t matrix_switch_computer_assist;
    button_t matrix_switch_override;
    lv_obj_t * matrix_switch_output_value;
    
} matrix_function_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Matrix Mapping Configuration Container Struct
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * slot;
    lv_obj_t * dd_slot;
    lv_obj_t * c0;
    lv_obj_t * dd_c0;
    lv_obj_t * c1;
    lv_obj_t * ta_c1;
    lv_obj_t * c2;
    lv_obj_t * ta_c2;
    lv_obj_t * c3;
    lv_obj_t * ta_c3;
    lv_obj_t * c4;
    lv_obj_t * ta_c4;
    lv_obj_t * c5;
    lv_obj_t * ta_c5;
    lv_obj_t * mode;
    lv_obj_t * dd_mode;
    lv_obj_t * input_value;
    lv_obj_t * value_input;
    lv_obj_t * map_result;
    lv_obj_t * value_map_result;
} mapping_config_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief GPS Switch Panel Container Struct
 */
typedef struct {
    lv_obj_t * panel;
    button_t switch_satio_panel;
    button_t switch_gngga_panel;
    button_t switch_gnrmc_panel;
    button_t switch_gpatt_panel;
} gps_switch_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief GNGGA Container Struct
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * lbl_utc_time;
    lv_obj_t * val_utc_time;
    lv_obj_t * lbl_latitude;
    lv_obj_t * val_latitude;
    lv_obj_t * lbl_longitude;
    lv_obj_t * val_longitude;
    lv_obj_t * lbl_solution_status;
    lv_obj_t * val_solution_status;
    lv_obj_t * lbl_sat_count;
    lv_obj_t * val_sat_count;
    lv_obj_t * lbl_gps_precision_factor;
    lv_obj_t * val_gps_precision_factor;
    lv_obj_t * lbl_altitude;
    lv_obj_t * val_altitude;
    lv_obj_t * lbl_geoidal;
    lv_obj_t * val_geoidal;
    lv_obj_t * lbl_differential_delay;
    lv_obj_t * val_differential_delay;
    lv_obj_t * lbl_bad_element_count;
    lv_obj_t * val_bad_element_count;
} gngga_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief GNRMC Container Struct
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * lbl_utc_time;
    lv_obj_t * val_utc_time;
    lv_obj_t * lbl_positioning_status;
    lv_obj_t * val_positioning_status;
    lv_obj_t * lbl_latitude;
    lv_obj_t * val_latitude;
    lv_obj_t * lbl_longitude;
    lv_obj_t * val_longitude;
    lv_obj_t * lbl_ground_speed;
    lv_obj_t * val_ground_speed;
    lv_obj_t * lbl_ground_heading;
    lv_obj_t * val_ground_heading;
    lv_obj_t * lbl_utc_date;
    lv_obj_t * val_utc_date;
    lv_obj_t * lbl_installation_angle;
    lv_obj_t * val_installation_angle;
    lv_obj_t * lbl_installation_angle_direction;
    lv_obj_t * val_installation_angle_direction;
    lv_obj_t * lbl_mode_indication;
    lv_obj_t * val_mode_indication;
    lv_obj_t * lbl_bad_element_count;
    lv_obj_t * val_bad_element_count;
} gnrmc_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief GPATT Container Struct
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * lbl_pitch;
    lv_obj_t * val_pitch;
    lv_obj_t * lbl_roll;
    lv_obj_t * val_roll;
    lv_obj_t * lbl_yaw;
    lv_obj_t * val_yaw;
    lv_obj_t * lbl_software_version;
    lv_obj_t * val_software_version;
    lv_obj_t * lbl_product_id;
    lv_obj_t * val_product_id;
    lv_obj_t * lbl_ins;
    lv_obj_t * val_ins;
    lv_obj_t * lbl_hardware_version;
    lv_obj_t * val_hardware_version;
    lv_obj_t * lbl_run_state_flag;
    lv_obj_t * val_run_state_flag;
    lv_obj_t * lbl_mis_angle_num;
    lv_obj_t * val_mis_angle_num;
    lv_obj_t * lbl_static_flag;
    lv_obj_t * val_static_flag;
    lv_obj_t * lbl_user_code;
    lv_obj_t * val_user_code;
    lv_obj_t * lbl_gst_data;
    lv_obj_t * val_gst_data;
    lv_obj_t * lbl_line_flag;
    lv_obj_t * val_line_flag;
    lv_obj_t * lbl_mis_att_flag;
    lv_obj_t * val_mis_att_flag;
    lv_obj_t * lbl_imu_kind;
    lv_obj_t * val_imu_kind;
    lv_obj_t * lbl_ubi_car_kind;
    lv_obj_t * val_ubi_car_kind;
    lv_obj_t * lbl_mileage;
    lv_obj_t * val_mileage;
    lv_obj_t * lbl_run_inetial_flag;
    lv_obj_t * val_run_inetial_flag;
    lv_obj_t * lbl_speed_num;
    lv_obj_t * val_speed_num;
    lv_obj_t * lbl_scalable;
    lv_obj_t * val_scalable;
    lv_obj_t * lbl_bad_element_count;
    lv_obj_t * val_bad_element_count;
} gpatt_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief SATIO Container Struct
 */
typedef struct {
    lv_obj_t * panel;

    /* ---------------------------------------------------------- */
    /* Title Positioning                                          */
    /* ---------------------------------------------------------- */
    lv_obj_t * lbl_title_location;
    lv_obj_t * lbl_deg_lat;
    lv_obj_t * val_deg_lat;
    lv_obj_t * lbl_user_deg_lat;
    lv_obj_t * ta_user_deg_lat;
    lv_obj_t * lbl_sys_deg_lat;
    lv_obj_t * val_sys_deg_lat;
    lv_obj_t * lbl_deg_lon;
    lv_obj_t * val_deg_lon;
    button_t btn_auto_set_user_lat;
    lv_obj_t * lbl_user_deg_lon;
    lv_obj_t * ta_user_deg_lon;
    button_t btn_auto_set_user_lon;
    lv_obj_t * lbl_sys_deg_lon;
    lv_obj_t * val_sys_deg_lon;
    lv_obj_t * lbl_location_mode; 
    button_t btn_location_mode_gps;
    button_t btn_location_mode_user;

    /* ---------------------------------------------------------- */
    /* Title Altitude                                             */
    /* ---------------------------------------------------------- */
    lv_obj_t * lbl_title_altitude;
    lv_obj_t * lbl_altitude;
    lv_obj_t * val_altitude;
    lv_obj_t * lbl_user_altitude;
    button_t btn_auto_set_user_altitude;
    lv_obj_t * ta_user_altitude;
    lv_obj_t * lbl_sys_altitude;
    lv_obj_t * val_sys_altitude;
    lv_obj_t * lbl_altitude_mode; 
    button_t btn_altitude_mode_gps;
    button_t btn_altitude_mode_user;

    /* ---------------------------------------------------------- */
    /* Title Speed                                                */
    /* ---------------------------------------------------------- */
    lv_obj_t * lbl_title_speed;
    lv_obj_t * lbl_speed;
    lv_obj_t * val_speed;
    lv_obj_t * lbl_user_speed;
    button_t btn_auto_set_user_speed;
    lv_obj_t * ta_user_speed;
    lv_obj_t * lbl_sys_speed;
    lv_obj_t * val_sys_speed;
    lv_obj_t * lbl_speed_mode; 
    button_t btn_speed_mode_gps;
    button_t btn_speed_mode_user;

    /* ---------------------------------------------------------- */
    /* Title Heading                                              */
    /* ---------------------------------------------------------- */
    lv_obj_t * lbl_title_heading;
    lv_obj_t * lbl_ground_heading_name;
    lv_obj_t * val_ground_heading_name;
    lv_obj_t * lbl_ground_heading;
    lv_obj_t * val_ground_heading;
    lv_obj_t * lbl_user_ground_heading;
    lv_obj_t * ta_user_ground_heading;
    button_t btn_auto_set_user_ground_heading;
    lv_obj_t * lbl_sys_ground_heading;
    lv_obj_t * val_sys_ground_heading;
    lv_obj_t * lbl_ground_heading_mode; 
    button_t btn_ground_heading_mode_gps;
    button_t btn_ground_heading_mode_user;

    /* ---------------------------------------------------------- */
    /* Title Mileage                                              */
    /* ---------------------------------------------------------- */
    lv_obj_t * lbl_title_mileage;
    lv_obj_t * lbl_mileage;
    lv_obj_t * val_mileage;

    /* ---------------------------------------------------------- */
    /* Title Local Time                                           */
    /* ---------------------------------------------------------- */
    lv_obj_t * lbl_title_local_time;
    lv_obj_t * lbl_local_unixtime_us;
    lv_obj_t * val_local_unixtime_us;
    lv_obj_t * lbl_local_yday;
    lv_obj_t * val_local_yday;
    lv_obj_t * lbl_local_wday_name;
    lv_obj_t * val_local_wday_name;
    lv_obj_t * lbl_local_month_name;
    lv_obj_t * val_local_month_name;
    lv_obj_t * lbl_formatted_local_time;
    lv_obj_t * val_formatted_local_time;
    lv_obj_t * lbl_formatted_local_date;
    lv_obj_t * val_formatted_local_date;
    lv_obj_t * lbl_utc_second_offset;
    lv_obj_t * ta_utc_second_offset;
    lv_obj_t * lbl_utc_auto_offset_flag;
    lv_obj_t * val_utc_auto_offset_flag;
    lv_obj_t * lbl_set_time_automatically;
    lv_obj_t * val_set_time_automatically;

    /* ---------------------------------------------------------- */
    /* Title RTC Time                                             */
    /* ---------------------------------------------------------- */
    lv_obj_t * lbl_title_rtc_time;
    lv_obj_t * lbl_rtc_unixtime;
    lv_obj_t * val_rtc_unixtime;
    lv_obj_t * lbl_formatted_rtc_time;
    lv_obj_t * val_formatted_rtc_time;
    lv_obj_t * lbl_formatted_rtc_date;
    lv_obj_t * val_formatted_rtc_date;

    /* ---------------------------------------------------------- */
    /* Title RTC Sync                                             */
    /* ---------------------------------------------------------- */
    lv_obj_t * lbl_title_rtc_sync;
    lv_obj_t * lbl_formatted_rtc_sync_time;
    lv_obj_t * val_formatted_rtc_sync_time;
    lv_obj_t * lbl_formatted_rtc_sync_date;
    lv_obj_t * val_formatted_rtc_sync_date;
    lv_obj_t * lbl_rtcsync_latitude;
    lv_obj_t * val_rtcsync_latitude;
    lv_obj_t * lbl_rtcsync_longitude;
    lv_obj_t * val_rtcsync_longitude;
    lv_obj_t * lbl_rtcsync_altitude;
    lv_obj_t * val_rtcsync_altitude;

} satio_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Gyro Container Struct
 */
typedef struct {
    lv_obj_t * panel;
    lv_obj_t * lbl_gyro_0_ang_x;
    lv_obj_t * val_gyro_0_ang_x;
    lv_obj_t * val_gyro_0_ang_y;
    lv_obj_t * val_gyro_0_ang_z;
    lv_obj_t * lbl_gyro_0_acc_x;
    lv_obj_t * val_gyro_0_acc_x;
    lv_obj_t * val_gyro_0_acc_y;
    lv_obj_t * val_gyro_0_acc_z;
    lv_obj_t * lbl_gyro_0_gyr_x;
    lv_obj_t * val_gyro_0_gyr_x;
    lv_obj_t * val_gyro_0_gyr_y;
    lv_obj_t * val_gyro_0_gyr_z;
    lv_obj_t * lbl_gyro_0_mag_x;
    lv_obj_t * val_gyro_0_mag_x;
    lv_obj_t * val_gyro_0_mag_y;
    lv_obj_t * val_gyro_0_mag_z;
    lv_obj_t * lbl_gyro_0_current_uiBaud;
    lv_obj_t * val_gyro_0_current_uiBaud;
} gyro_0_container_t;

/** ---------------------------------------------------------------------------------------
 * @brief Serial Container Struct
 */
typedef struct {
    lv_obj_t * panel;

